RIET/src/Catalogs/rgsBudgetItem/rgsBudgetItem.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>rgsBudgetItem</name>
  <attributes>
    <name>BudgetPercentType</name>
    <type>
      <types>EnumRef.rgsBudgetPercentTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>GroupLevel</name>
    <type>
      <types>CatalogRef.GeoMarkets</types>
      <types>CatalogRef.rgsBudgetItem</types>
      <types>CatalogRef.Сегменты</types>
    </type>
  </attributes>
  <attributes>
    <name>SubLevel</name>
    <type>
      <types>CatalogRef.GeoMarkets</types>
      <types>EnumRef.DomesticInternational</types>
      <types>CatalogRef.Сегменты</types>
    </type>
  </attributes>
</mdclass:Catalog>

RIET/src/Enums/DomesticInternational/DomesticInternational.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>DomesticInternational</name>
  <enumValues>
    <name>Domestic</name>
  </enumValues>
  <enumValues>
    <name>International</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Enums/rgsBudgetPercentTypes/rgsBudgetPercentTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>rgsBudgetPercentTypes</name>
  <enumValues>
    <name>InternationalDomestic</name>
  </enumValues>
  <enumValues>
    <name>Sub_Geomarket</name>
  </enumValues>
  <enumValues>
    <name>Sub_Segment</name>
  </enumValues>
  <enumValues>
    <name>SubGeomarket_Segment</name>
  </enumValues>
  <enumValues>
    <name>Geomarket_Segment</name>
  </enumValues>
  <enumValues>
    <name>RevenueProcent</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Catalogs/rgsBudgetItem/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура BudgetPercentTypeПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Элемент.ТекстРедактирования)тогда
		
		Элементы.GroupLevel.Доступность = ложь;
		Элементы.SubLevel.Доступность = ложь;
		
	Иначе
		
		Элементы.GroupLevel.Доступность = истина;
		Элементы.SubLevel.Доступность = истина;
		
	КонецЕсли;
	
	Тип = ВернутьТипПроцентаRevenueProcent(); 
	Если Объект.BudgetPercentType = Тип тогда
		Элементы.SubLevel.ОтметкаНезаполненного = Ложь;
	КонецЕсли;
	
	RevenuePercent = ВернутьТипПроцентаRevenueProcent();
	
	Если Объект.BudgetPercentType = RevenuePercent тогда
		Элементы.SubLevel.Видимость = ложь;
	иначе
		Элементы.SubLevel.Видимость = Истина;
	КонецЕсли;
	
	
	ПоменятьТип(Элемент.ТекстРедактирования);
	
	ЗаполнитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЗначениеЗаполнено(Объект.BudgetPercentType)тогда
		Элементы.GroupLevel.Доступность = ложь;
		Элементы.SubLevel.Доступность = ложь;	
	КонецЕсли;
	RevenuePercent = ВернутьТипПроцентаRevenueProcent();
	Если Объект.BudgetPercentType = RevenuePercent тогда
		Элементы.SubLevel.Видимость = ложь;
	иначе
		Элементы.SubLevel.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура SubLevelНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ложь;
	Отбор = Новый Структура();
	
	Если ЗначениеЗаполнено (Объект.GroupLevel) Тогда
		Отбор.Вставить("Родитель", Объект.GroupLevel);
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("Отбор", Отбор);
	Если Элементы.BudgetPercentType.ТекстРедактирования <> "International domestic" тогда
		Если Элементы.BudgetPercentType.ТекстРедактирования = "Sub geomarket" тогда
			ОткрытьФорму("Справочник.GeoMarkets.ФормаВыбора", ПараметрыОткрытия, Элемент);
			ПараметрыОткрытия.Отбор.Вставить("ЭтоГруппа", Истина);
		ИначеЕсли  Элементы.BudgetPercentType.ТекстРедактирования = "Sub segment" тогда
			Отбор = Новый Структура();
			Item = ПолучитьСегмент(Объект.GroupLevel);
			Отбор.Вставить("Родитель", Item);
			ПараметрыОткрытия = Новый Структура();
			ПараметрыОткрытия.Вставить("Отбор", Отбор);		
			ОткрытьФорму("Справочник.Сегменты.ФормаВыбораГруппы",ПараметрыОткрытия , Элемент);			
		ИначеЕсли Элементы.BudgetPercentType.ТекстРедактирования = "Sub geomarket segment" или Элементы.BudgetPercentType.ТекстРедактирования = "Geomarket segment" тогда
			ОткрытьФорму("Справочник.Сегменты.ФормаВыбораГруппы",, Элемент);
		КонецЕсли;
	Иначе 		
		ОткрытьФорму("Перечисление.DomesticInternational.ФормаВыбора",, Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура SubLevelПриИзменении(Элемент)
	ЗаполнитьНаименование();	
КонецПроцедуры

&НаКлиенте
Процедура GroupLevelПриИзменении(Элемент)
	ЗаполнитьНаименование();
КонецПроцедуры


&НаКлиенте
Процедура GroupLevelНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Тип = ВернутьТипПроцентаSubSegment();
	Если Объект.BudgetPercentType = Тип тогда	
		Тип = ВернутьТипПроцентаSubGeomarket_Segment();
		Отбор = Новый Структура();
		Отбор.Вставить("BudgetPercentType", Тип);	
		ПараметрыОткрытия = Новый Структура();
		ПараметрыОткрытия.Вставить("Отбор", Отбор);
		ОткрытьФорму("Справочник.rgsBudgetItem.ФормаВыбора", ПараметрыОткрытия, Элемент);		
	Иначе
		ОткрытьФорму("Справочник.GeoMarkets.ФормаВыбораГруппы", , Элемент);	
	КонецЕсли;	
КонецПроцедуры

Функция ЗаполнитьПоле()
	
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить(Перечисления.DomesticInternational.Domestic);
	СписокВыбора.Добавить(Перечисления.DomesticInternational.International);
	
	возврат СписокВыбора 
	
	
КонецФункции

&НаСервере
Процедура ПоменятьТип(Значение)
	Если Значение = "International domestic" тогда
		Объект.GroupLevel = Справочники.GeoMarkets.ПустаяСсылка();
		Объект.SubLevel = Перечисления.DomesticInternational.Domestic;
	ИначеЕсли Значение = "Sub segment" тогда
		Объект.GroupLevel = Справочники.rgsBudgetItem.ПустаяСсылка();
		Объект.SubLevel =  Справочники.Сегменты.ПустаяСсылка();
	Иначе
		Объект.GroupLevel = Справочники.GeoMarkets.ПустаяСсылка();
		Объект.SubLevel =  Справочники.GeoMarkets.ПустаяСсылка();
	КонецЕсли;	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьНаименование()
	RevenuePercent = ВернутьТипПроцентаRevenueProcent();	
	Если Объект.BudgetPercentType = RevenuePercent тогда
		Объект.Наименование = "" + СокрЛП(Объект.BudgetPercentType) + "/" + СокрЛП(Объект.GroupLevel);
	иначе	
		Объект.Наименование = "" + СокрЛП(Объект.BudgetPercentType) + "/" + СокрЛП(Объект.GroupLevel) + "/" + СокрЛП(Объект.SubLevel);
	КонецЕсли;
КонецПроцедуры


&НаСервере
Функция ВернутьТипПроцентаSubGeomarket_Segment()
	Возврат Перечисления.rgsBudgetPercentTypes.SubGeomarket_Segment	
КонецФункции

&НаСервере
Функция ВернутьТипПроцентаSubSegment()
	Возврат Перечисления.rgsBudgetPercentTypes.Sub_Segment	
КонецФункции


&НаСервере
Функция ВернутьТипПроцентаRevenueProcent()
	Возврат Перечисления.rgsBudgetPercentTypes.RevenueProcent	
КонецФункции


&НаСервере
Функция ПолучитьСегмент(Сегмент)
	
	Возврат Сегмент.Sublevel	
	
КонецФункции
